Tested the autoscaling example and it's all working as expected (output attached):

```
> terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_pet.this will be created
  + resource "random_pet" "this" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

  # module.dynamodb_table.aws_appautoscaling_policy.index_read_policy["TitleIndex"] will be created
  + resource "aws_appautoscaling_policy" "index_read_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "dynamodb:index:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 0
          + scale_out_cooldown = 0
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table.aws_appautoscaling_policy.index_write_policy["TitleIndex"] will be created
  + resource "aws_appautoscaling_policy" "index_write_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "dynamodb:index:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 0
          + scale_out_cooldown = 0
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table.aws_appautoscaling_policy.table_read_policy[0] will be created
  + resource "aws_appautoscaling_policy" "table_read_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 50
          + scale_out_cooldown = 40
          + target_value       = 45

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table.aws_appautoscaling_policy.table_write_policy[0] will be created
  + resource "aws_appautoscaling_policy" "table_write_policy" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 50
          + scale_out_cooldown = 40
          + target_value       = 45

          + predefined_metric_specification {
              + predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # module.dynamodb_table.aws_appautoscaling_target.index_read["TitleIndex"] will be created
  + resource "aws_appautoscaling_target" "index_read" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 30
      + min_capacity       = 10
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:index:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # module.dynamodb_table.aws_appautoscaling_target.index_write["TitleIndex"] will be created
  + resource "aws_appautoscaling_target" "index_write" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 30
      + min_capacity       = 10
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:index:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # module.dynamodb_table.aws_appautoscaling_target.table_read[0] will be created
  + resource "aws_appautoscaling_target" "table_read" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 5
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:ReadCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # module.dynamodb_table.aws_appautoscaling_target.table_write[0] will be created
  + resource "aws_appautoscaling_target" "table_write" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 5
      + resource_id        = (known after apply)
      + role_arn           = (known after apply)
      + scalable_dimension = "dynamodb:table:WriteCapacityUnits"
      + service_namespace  = "dynamodb"
      + tags_all           = (known after apply)
    }

  # module.dynamodb_table.aws_dynamodb_table.autoscaled_gsi_ignore[0] will be created
  + resource "aws_dynamodb_table" "autoscaled_gsi_ignore" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = (known after apply)
      + range_key        = "title"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 5

      + attribute {
          + name = "age"
          + type = "N"
        }
      + attribute {
          + name = "id"
          + type = "N"
        }
      + attribute {
          + name = "title"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "title"
          + name               = "TitleIndex"
          + non_key_attributes = [
              + "id",
            ]
          + projection_type    = "INCLUDE"
          + range_key          = "age"
          + read_capacity      = 10
          + write_capacity     = 10
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dynamodb_table_arn = (known after apply)
  + dynamodb_table_id  = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

random_pet.this: Creating...
random_pet.this: Creation complete after 0s [id=grown-chicken]
module.dynamodb_table.aws_dynamodb_table.autoscaled_gsi_ignore[0]: Creating...
module.dynamodb_table.aws_dynamodb_table.autoscaled_gsi_ignore[0]: Still creating... [10s elapsed]
module.dynamodb_table.aws_dynamodb_table.autoscaled_gsi_ignore[0]: Creation complete after 13s [id=my-table-grown-chicken]
module.dynamodb_table.aws_appautoscaling_target.table_read[0]: Creating...
module.dynamodb_table.aws_appautoscaling_target.table_write[0]: Creating...
module.dynamodb_table.aws_appautoscaling_target.index_write["TitleIndex"]: Creating...
module.dynamodb_table.aws_appautoscaling_target.index_read["TitleIndex"]: Creating...
module.dynamodb_table.aws_appautoscaling_target.index_write["TitleIndex"]: Creation complete after 1s [id=table/my-table-grown-chicken/index/TitleIndex]
module.dynamodb_table.aws_appautoscaling_policy.index_write_policy["TitleIndex"]: Creating...
module.dynamodb_table.aws_appautoscaling_target.table_write[0]: Creation complete after 1s [id=table/my-table-grown-chicken]
module.dynamodb_table.aws_appautoscaling_target.index_read["TitleIndex"]: Creation complete after 1s [id=table/my-table-grown-chicken/index/TitleIndex]
module.dynamodb_table.aws_appautoscaling_target.table_read[0]: Creation complete after 1s [id=table/my-table-grown-chicken]
module.dynamodb_table.aws_appautoscaling_policy.table_write_policy[0]: Creating...
module.dynamodb_table.aws_appautoscaling_policy.index_read_policy["TitleIndex"]: Creating...
module.dynamodb_table.aws_appautoscaling_policy.table_read_policy[0]: Creating...
module.dynamodb_table.aws_appautoscaling_policy.index_write_policy["TitleIndex"]: Creation complete after 0s [id=DynamoDBWriteCapacityUtilization:table/my-table-grown-chicken/index/TitleIndex]
module.dynamodb_table.aws_appautoscaling_policy.table_write_policy[0]: Creation complete after 0s [id=DynamoDBWriteCapacityUtilization:table/my-table-grown-chicken]
module.dynamodb_table.aws_appautoscaling_policy.table_read_policy[0]: Creation complete after 0s [id=DynamoDBReadCapacityUtilization:table/my-table-grown-chicken]
module.dynamodb_table.aws_appautoscaling_policy.index_read_policy["TitleIndex"]: Creation complete after 0s [id=DynamoDBReadCapacityUtilization:table/my-table-grown-chicken/index/TitleIndex]

Apply complete! Resources: 10 added, 0 changed, 0 destroyed.

Outputs:

dynamodb_table_arn = "arn:aws:dynamodb:eu-west-1:xxxxxxxxx:table/my-table-grown-chicken"
dynamodb_table_id = "my-table-grown-chicken"
```